src/Catalogs/Projects.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Projects</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Companies</xr:Item>
			</Owners>
		</Properties>
	</Catalog>
</MetaDataObject>

src/AccumulationRegisters/ProjectData.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>ProjectData</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Catalogs/Projects/Forms/ListForm/Ext/Form/Module.bsl
&AtClient
Procedure Transactions(Command)
	
	ParametersStructure = New Structure;	
	ParametersStructure.Insert("Filter", New Structure("Project", Items.List.CurrentRow)); 
	
	OpenForm("AccumulationRegister.ProjectData.ListForm", ParametersStructure, , True);
	
EndProcedure

&AtClient
Procedure TransactionsWithoutProject(Command)
	
	ParametersStructure = New Structure;	
	ParametersStructure.Insert("Filter", New Structure("Project", PredefinedValue("Catalog.Projects.EmptyRef"))); 
	
	OpenForm("AccumulationRegister.ProjectData.ListForm", ParametersStructure, , True);
	
EndProcedure
